#pragma once

#include <windows.h>
#include <cstdint>

using D3DXVECTOR3 = float[3];

#pragma pack(push, 1)
struct entity_t
{
	char pad_0x0000[0x28]; // 0x0000
	BYTE entity_type; // 0x0028
	char pad_0x0029[0x3]; // 0x0029
	BYTE invisible; // 0x002C
	char pad_0x002D[0x3]; // 0x002D
	uint64_t pos_base; // 0x0030
	char pad_0x0038[0x58]; // 0x0038
	D3DXVECTOR3 pos; // 0x0090
	char pad_0x009C[0xED]; // 0x009C
	BYTE god; // 0x0189
	char pad_0x018A[0xF6]; // 0x018A
	float health; // 0x0280
	char pad_0x0284[0x1C]; // 0x0284
	float max_health; // 0x02A0
};

struct ped_t : entity_t
{
	char pad_0x02A4[0xA8C]; // 0x02A4
	uint64_t vehicle; // 0x0D30
	char pad_0x0D38[0x380]; // 0x0D38
	uint32_t ped_type; // 0x10B8
	char pad_0x10BC[0xC]; // 0x10BC
	uint64_t player_info; // 0x10C8
	char pad_0x10D0[0x33C]; // 0x10D0
	BYTE bike_seatbelt; // 0x140C (0xC8 = off; 0xC9 = on)
	char pad_0x140D[0xB]; // 0x140D
	BYTE vehicle_seatbelt; // 0x1418 (0x01 = off; 0x00 = on)
	char pad_0x1419[0x5E]; // 0x1419
	BYTE in_vehicle; // 0x1477
	char pad_0x1478[0x68]; // 0x1478
	float armor; // 0x14E0
};

struct player_info_t
{
	char pad_0x0000[0xA4]; // 0x0000
	char name[20]; // 0x00A4
};
#pragma pack(pop)
